[
    {
        "id": "c67a30a7",
        "title": "Le grand marché",
        "cover": "https://zupimages.net/up/24/51/4p4b.jpg",
        "description": "Faire une analyse de ventes pour un e-commerce...",
        "contexte": "Je devais analyser les données des clients affiliés pour en tirer des insights significatifs qui pourraient guider les décisions stratégiques de l'entreprise. Mon objectif était de créer un rapport mensuel clair et accessible, accompagné de graphiques pertinents et d'une proposition d'axes stratégiques.",
        "problématique": "Comment présenter efficacement les données d'analyse mensuelle des clients affiliés pour permettre une prise de décision éclairée et proposer des axes d'amélioration pour Le Grand Marché ?",
        "details": "",
        "tags": [
            "Excel",
            "Storytelling",
            "Powerpoint"
        ],
        "github": "https://github.com/Ibrahimae/OC_Projet6_Kasa"
    },
    {
        "id": "c67ab821",
        "title": "Assurance",
        "cover": "https://zupimages.net/up/24/51/lbwy.jpeg",
        "description": "Requêtez une base de données avec SQL...",
        "contexte": "L'objectif principal était d'apprendre à créer et gérer des bases de données en utilisant SQL. Je devais explorer les données, les traiter et les visualiser, ce qui est fondamental pour une carrière en data analysis ou business intelligence.",
        "problématique": "La problématique à laquelle j'étais confronté était : Comment récupérer et analyser efficacement des données à partir d'une base de données ? Cela impliquait de bien comprendre les types de données, la conception de schémas relationnels, et de savoir rédiger des requêtes SQL pour extraire les informations pertinentes.",
        "details": "J'ai été amené à créer une API en suivant un document de spécifications techniques tout en prenant en compte la taille des images pour que le projet soit conforme aux bonnes pratiques de Green Code. J'ai aussi dû stocker des données de manière sécurisée, mettre en oeuvre des opérations CRUD de manière sécurisée et implémenter un modèle de logique de données conformément à la réglementation.",
        "tags": [
            "SQL"
        ],
        "github": "https://github.com/Ibrahimae/P7"
    },
    {
        "id": "b2123946",
        "title": "Food and Agriculture Organization of the United Nations (FAO)",
        "cover": "https://zupimages.net/up/24/51/wkbz.png",
        "description": "Réalisez une étude de santé publique avec Python...",
        "contexte": "La sous-nutrition restait un problème de santé publique majeur dans le monde entier, touchant des millions de personnes, en particulier dans les régions en développement. Selon les rapports de la FAO et d'autres organisations internationales, des facteurs tels que la pauvreté, les conflits et les changements climatiques contribuaient à l'aggravation de la sécurité alimentaire. Entre 2013 et 2017, diverses politiques et initiatives avaient été mises en œuvre dans le but d'améliorer la nutrition des populations vulnérables.",
        "problématique": "Je devais analyser comment l'évolution des taux de sous-nutrition entre 2013 et 2017 était influencée par les facteurs socio-économiques et environnementaux. Il s'agissait d'identifier les tendances dans les données historiques et de déterminer comment ces informations pouvaient informer les politiques actuelles et futures visant à lutter contre la sous-nutrition.",
        "details": "",
        "tags": [
            "Python"
        ],
        "github": "https://github.com/Ibrahimae"
    },
    {
        "id": "c623aba7",
        "title": "Laplace Immo,",
        "cover": "https://zupimages.net/up/24/51/y8to.png",
        "description": "Créez et utilisez une base de données immobilière avec SQL...",
        "contexte": "Je devais agir en tant que Data Analyst pour Laplace Immo, un réseau d'agences immobilières en France. Le contexte était centré sur la nécessité de créer une base de données efficace pour collecter et analyser les transactions immobilières et foncières. Cela impliquait non seulement de s'assurer que la base de données était bien conçue pour stocker des informations pertinentes, mais également de garantir que ces données respectaient la réglementation RGPD",
        "problématique": "La problématique principale était donc de comprendre comment adapter la structure de la base de données pour y intégrer de nouvelles données tout en maintenant sa conformité avec les exigences légales. Je devais également réfléchir à la manière d'utiliser cette base de données pour effectuer des analyses pertinentes afin d'aider l'entreprise à identifier les tendances du marché immobilier.",
        "tags": [
            "BDD",
            "SQL",
            "RGPD"
        ],
        "github": "https://github.com/Ibrahimae/OC-p5"
    },
    {
        "id": "c67ab1a7",
        "title": "BottleNeck",
        "cover": "https://zupimages.net/up/24/51/3pvt.jpg",
        "description": "Optimisez la gestion des données d'une boutique avec Python...",
        "contexte": "Le contexte se situait dans un environnement de vente au détail, où une boutique, comme BottleNeck, devait gérer un large éventail de données concernant son stock, son chiffre d'affaires et ses clients.",
        "problématique": "La problématique résidait dans le besoin d'analyser ces données de manière efficace et précise afin d'identifier les erreurs possibles, d’optimiser la gestion des stocks, d’améliorer le chiffre d'affaires et d’analyser les marges bénéficiaires. Je devais non seulement traiter et nettoyer ces données, mais aussi utiliser des méthodes d’analyse pour tirer des conclusions pertinentes qui pourraient aider à la prise de décisions stratégiques pour le comité de direction.",
        "tags": [
            "Python",
            "Jeu de donnée"
        ],
        "github": "https://github.com/Ibrahimae/Booki"
    },
    {
        "id": "c67348a7",
        "title": "ESN Data",
        "cover": "https://zupimages.net/up/24/51/3sh0.jpg",
        "description": "Créez un tableau de bord dynamique avec Power BI pour visualiser l'avancement de projets...",
        "contexte": "Je devais commencer par décrire l'entreprise ou l'organisation pour laquelle je développais le tableau de bord. Il s'agissait de comprendre ses activités, ses objectifs, et comment les données jouaient un rôle clé dans sa prise de décision. Cela impliquait également de prendre en compte les enjeux spécifiques du secteur d'activité du client.",
        "problématique": "Je devais identifier le besoin spécifique du client. Quelles questions cherchaient-ils à résoudre grâce à ce tableau de bord ? Quelles données étaient pertinentes pour atteindre ces objectifs ? Par exemple, le client pouvait vouloir suivre l'avancement de divers projets, identifier des retards, ou mieux comprendre les performances de son équipe.",
        "tags": [
            "Power BI",
            "DAX"
        ],
        "github": ""
    },

    {
        "id": "d4e1b6f8",
        "title": "cabinet de consultants",
        "cover": "https://zupimages.net/up/24/51/04ox.jpeg",
        "description": "Analysez des indicateurs de l'égalité femmes/hommes en respect du RGPD...",
        "contexte": "Dans ce projet, je devais évoluer dans un cabinet de consultants spécialisé dans la transformation digitale. La directrice des ressources humaines m'avait sollicité pour automatiser la création d'un rapport sur l'égalité professionnelle entre les femmes et les hommes, en utilisant des données provenant du Système d’Information des Ressources Humaines (SIRH).",
        "problématique": "La problématique tournait autour de la nécessité de respecter le Règlement Général sur la Protection des Données (RGPD) tout en analysant des indicateurs clés de l'égalité femmes/hommes. Je devais donc trouver un équilibre entre l'exploitation des données pour produire des analyses pertinentes et la protection de la vie privée des employés.",
        "tags": [
            "Excel",
            "KNIME"
        ],
        "github": "https://github.com/Ibrahimae/MarketInsights"
    },
    {
        "id": "f9c2a4e7",
        "title": "Lapage",
        "cover": "https://zupimages.net/up/24/51/8pyj.jpg",
        "description": "Analysez les ventes d'une librairie avec Python...",
        "contexte": "Le projet consistait à analyser les ventes d'une librairie, en ligne et physique, pour aider l'entreprise Lapage à orienter ses décisions stratégiques. Avec l'ouverture d'un site de vente en ligne, il était essentiel de comprendre comment les ventes fonctionnaient, quels produits se vendaient le mieux, et comment se comportaient les clients.",
        "problématique": "La problématique principale résidait dans l'interprétation des données de vente afin de déterminer des stratégies marketing et opérationnelles efficaces. Je devais analyser comment ces indicateurs de vente pouvaient révéler des tendances et des corrélations importantes, et comment ces analyses pouvaient influencer la prise de décision au sein de l'entreprise.",
        "tags": [
            "Donnée",
            "Analyse statistique",
            "Series temporelles"
        ],
        "github": "https://github.com/Ibrahimae/GreenEnergy"
    },
    {
        "id": "a3f7d2b1",
        "title": "ONG DWFA",
        "cover": "https://zupimages.net/up/24/51/u2uv.jpg",
        "description": "Faire une étude sur l'eau potable...",
        "contexte": "L'eau potable est essentielle à la santé humaine, au développement économique et à la durabilité environnementale. Pourtant, de nombreuses personnes à travers le monde n'ont pas accès à une eau de qualité. Environ 2 milliards de personnes vivaient dans des zones où l'eau était rare, ce qui impactait leur qualité de vie et leur santé.",
        "problématique": "Je devais identifier les pays les plus touchés par un manque d'accès à l'eau potable et déterminer quelles données étaient nécessaires pour illustrer ces disparités. Il s'agissait également d'examiner les implications de l'accès à l'eau potable sur la santé publique et le développement socio-économique.",
        "tags": [
            "Power BI"
        ],
        "github": "https://github.com/Ibrahimae/RetailDashboard"
    },
    {
        "id": "b8c4e6d3",
        "title": "La poule qui chante",
        "cover": "https://zupimages.net/up/24/51/health.jpg",
        "description": "Produire une étude de marché avec Python...",
        "contexte": "Je devais accompagner La poule qui chante, une entreprise qui souhaitait s'étendre à l'international. Cette entreprise avait besoin de comprendre les dynamiques du marché mondial pour prendre des décisions éclairées sur ses futurs axes de développement.",
        "problématique": "Je devais déterminer dans quels pays l'entreprise pourrait se développer avec succès, en m'appuyant sur une analyse de données approfondie. Cela impliquait de collecter et d'analyser des données pertinentes, de réaliser une étude de marché complète, et de formuler des recommandations stratégiques à présenter au COMEX.",
        "tags": [
            "ACP",
            "Statistiques",
            "Python"
        ],
        "github": "https://github.com/Ibrahimae/HealthData"
    },
    {
        "id": "c6f9a8e2",
        "title": "L’Organisation nationale de lutte contre le faux-monnayage (ONCFM)",
        "cover": "https://zupimages.net/up/24/51/innp.jpg",
        "description": "Détectez des faux billets avec Python...",
        "contexte": "Dans ce projet, je devais travailler pour l'Organisation nationale de lutte contre le faux-monnayage (ONCFM). La problématique concernait la détection des faux billets, un enjeu majeur pour la sécurité économique. Mon rôle était de développer un algorithme en R ou Python capable d'analyser un dataset de billets scannés afin de prédire l'authenticité de chaque billet.",
        "problématique": "Le contexte impliquait l'utilisation de techniques de machine learning, notamment des algorithmes comme K-means, Régression logistique, KNN et Random Forest, pour extraire des caractéristiques pertinentes des données et améliorer la précision de mes prédictions.",
        "tags": [
            "Python",
            "Machine learning",
            "Optimisation"
        ],
        "github": "https://github.com/Ibrahimae/TransportOptimization"
    }
]